package th.go.rd.rdepaymentservice.constant;

public interface ResponseCode {

    public final String I07000 = "I07000"; // สำเร็จ
    public final String E07000 = "E07000"; // ไม่สำเร็จ [{0}]
    public final String E07001 = "E07001"; // ไม่สามารถสร้างรายการชำระภาษีได้ [{0}]
    public final String E07100 = "E07100"; // ไม่พบข้อมูลในระบบ [{0}]
    public final String E07011 = "E07011"; // ไม่สามารถเข้ารหัส / ลงลายมือชื่อข้อมูล XML [{0}]
    public final String E07002 = "E07002"; // ไม่สามารถตรวจสอบสถานะการชำระเงิน  [{0}]
    public final String E07003 = "E07003"; // ไม่สามารถถอดรหัส / ตรวจสอบลายมือชื่อข้อมูล XML [{0}]
    public final String E07004 = "E07004"; // ไม่สามารถสร้างชุดชำระเงิน [{0}]
    public final String E07101 = "E07101"; // ไม่มีสิทธิ์ใช้งาน [{0}]
    public final String E07102 = "E07102"; // ไม่สามารถเชื่อมต่อ Database [{0}]
    public final String E07103 = "E07103"; // ไม่สามารถทำรายการได้  [{0}]
    public final String E07104 = "E07104"; // ไม่สามารถเชื่อมต่อระบบที่เกี่ยวข้องได้ (Internal) [{0}]
    public final String E07105 = "E07105"; // ไม่สามารถทำรายการได้ เนื่องจากข้อมูลที่ส่งเข้ามาอยู่นอกวันที่ให้บริการ  [{0}]
    public final String E07106 = "E07106"; // ไม่สามารถทำรายการได้ เนื่องจากช่องทางชำระภาษีปิดให้บริการ [{0}]
    public final String E07107 = "E07107"; // ไม่สามารถทำรายการได้ เนื่องจากเป็นข้อมูลที่ทำรายการไปแล้ว [{0}]
    public final String E07108 = "E07108"; // ไม่สามารถทำรายการได้ เนื่องจากชำระเกินวันที่กำหนด [{0}]
    public final String E07109 = "E07109"; // ไม่สามารถทำรายการได้ เนื่องจากชำระซ้ำ [{0}]
    public final String E07110 = "E07110"; // ไม่สามารถทำรายการได้ เนื่องจากรายการแบบถูกยกเลิก [{0}]
    public final String E07111 = "E07111"; // ไม่สามารถทำรายการได้ เนื่องจากไม่พบช่องทางชำระภาษีที่เปิดให้บริการ [{0}]
    public final String E07112 = "E07112"; // ไม่สามารถทำรายการได้ เนื่องจากรายการชุดชำระถูกยกเลิก [{0}]
    public final String E07113 = "E07113"; // ข้อมูลไม่ถูกต้อง [{0}]

}